## 3. 데이터 선택
  - 인덱싱 arr[2,1]
  - 슬라이싱 arr[:,1:5]
  - 마스킹 arr[arr>0]
  - 팬시인덱싱 arr[0, [1,5]]
  - 그 외 조합 arr[:, [1,5]]

### 3.1 인덱싱

Series

In [1]:
import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [2]:
data['c']

0.75

DataFrame

In [3]:
population_dic = {'California': 300,
              'Texas':250,
              'New York':200,
              'Florida':190,
              'Illinois':120}
population = pd.Series(population_dic)
area_dict = {'California': 40,
             'Texas': 70,
             'New York': 15,
             'Florida': 17,
             'Illinois': 15}
area = pd.Series(area_dict)
df = pd.DataFrame({'area':area, 'population':population})
df

            area  population
California    40         300
Texas         70         250
New York      15         200
Florida       17         190
Illinois      15         120

In [4]:
df['area'] # 열에 접근

California    40
Texas         70
New York      15
Florida       17
Illinois      15
Name: area, dtype: int64

In [5]:
df.area

California    40
Texas         70
New York      15
Florida       17
Illinois      15
Name: area, dtype: int64

In [6]:
df.values[0] # 행에 접근

array([ 40, 300], dtype=int64)

### 3.2 슬라이싱

Series
- 명시적 인덱스로 슬라이싱 할 때는 최종 인덱스가 포함
  - 인덱서 : loc / iloc / ix

In [8]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [9]:
data['a':'c'] # 명시적 인덱스

a    0.25
b    0.50
c    0.75
dtype: float64

In [10]:
data[0:3] # 암묵적 인덱스

a    0.25
b    0.50
c    0.75
dtype: float64

- 인덱서(indexer) : 명시적 인덱스와 암묵적 인덱스의 구분
    - loc : 명시적 인덱스
    - iloc : 암묵적 인덱스

In [11]:
data = pd.Series(['a','b','c'], index=[1,3,5])
data

1    a
3    b
5    c
dtype: object

In [12]:
data[1] #명시적 인덱스 사용

'a'

In [13]:
data[1:3] #암묵적 인덱스 사용

3    b
5    c
dtype: object

In [14]:
data.loc[1] #명시적 인덱스 속성 사용

'a'

In [15]:
data.loc[1:3] #명시적 인덱스 속성 사용

1    a
3    b
dtype: object

In [16]:
data.iloc[1] # 암묵적 인덱스 속성 사용

'b'

In [17]:
data.iloc[1:3] # 암묵적 인덱스 속성 사용

3    b
5    c
dtype: object

DataFrame

In [18]:
df

            area  population
California    40         300
Texas         70         250
New York      15         200
Florida       17         190
Illinois      15         120

In [19]:
df.iloc[:3,:2]

            area  population
California    40         300
Texas         70         250
New York      15         200

In [20]:
df.loc['California':'New York',:'population']

            area  population
California    40         300
Texas         70         250
New York      15         200

### 3.3 마스킹

Series

In [21]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [22]:
(data>0.3)&(data<0.8)

a    False
b     True
c     True
d    False
dtype: bool

In [23]:
data[(data>0.3)&(data<0.8)]

b    0.50
c    0.75
dtype: float64

DataFrame

In [24]:
df

            area  population
California    40         300
Texas         70         250
New York      15         200
Florida       17         190
Illinois      15         120

In [25]:
df.loc[df.area>20, 'population']

California    300
Texas         250
Name: population, dtype: int64

### 3.4 팬시인덱싱

Series

In [26]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [27]:
data[['a','d']]

a    0.25
d    1.00
dtype: float64

DataFrame

In [28]:
df

            area  population
California    40         300
Texas         70         250
New York      15         200
Florida       17         190
Illinois      15         120

In [29]:
df.loc[['Texas','Illinois'],['area','population']]

          area  population
Texas       70         250
Illinois    15         120

### 3.5 그 외
- 인덱싱은 열을 참조하는 반면, 슬라이싱은 행을 참조

In [30]:
df

            area  population
California    40         300
Texas         70         250
New York      15         200
Florida       17         190
Illinois      15         120

In [32]:
df['area']

California    40
Texas         70
New York      15
Florida       17
Illinois      15
Name: area, dtype: int64

In [31]:
df[1:3]

          area  population
Texas       70         250
New York    15         200